Yolk-Workshop/Yolk-Keyboard/Core/Src/hardware/m24512e_driver.c
#include "m24512e_driver.h"

/* Private function prototypes */
static m24512e_status_t m24512e_write_register(m24512e_handle_t *handle, uint8_t addr_high, uint8_t data);
static m24512e_status_t m24512e_read_register(m24512e_handle_t *handle, uint8_t addr_high, uint8_t *data);
static uint8_t m24512e_get_device_select_code(uint8_t base_code, uint8_t chip_addr, bool read_operation);
static void m24512e_crc_init(void);



/*Initialize system with CRC peripheral enabled
 * @note Call this function during system initialization
 */
void m24512e_system_init(void)
{
    /* Enable CRC peripheral clock */
    __HAL_RCC_CRC_CLK_ENABLE();

    /* Configure CRC peripheral for CRC-16 calculations */
    m24512e_crc_init();
}

/**
 * @brief Initialize M24512E-F EEPROM driver
 * @param handle Pointer to device handle
 * @param hi2c Pointer to I2C handle (I2C2)
 * @param device_addr Device chip enable address (0-7)
 * @return Status code
 */
m24512e_status_t m24512e_init(m24512e_handle_t *handle, I2C_HandleTypeDef *hi2c, uint8_t device_addr)
{
    if (!handle || !hi2c || device_addr > 7) {
        return M24512E_ERROR;
    }

    handle->hi2c = hi2c;
    handle->device_address = device_addr;
    handle->write_protection_enabled = false;
    handle->last_write_time = 0;

    /* Wait for power-up wake time */
    HAL_Delay(M24512E_WAKE_UP_DELAY);

    /* Verify device is present and responding */
    if (!m24512e_is_device_ready(handle)) {
        return M24512E_ERROR;
    }

    return M24512E_OK;
}

/**
 * @brief Deinitialize M24512E-F EEPROM driver
 * @param handle Pointer to device handle
 * @return Status code
 */
m24512e_status_t m24512e_deinit(m24512e_handle_t *handle)
{
    if (!handle) {
        return M24512E_ERROR;
    }

    handle->hi2c = NULL;
    handle->device_address = 0;
    handle->write_protection_enabled = false;
    handle->last_write_time = 0;

    return M24512E_OK;
}

/**
 * @brief Check if device is ready for communication
 * @param handle Pointer to device handle
 * @return true if device is ready, false otherwise
 */
bool m24512e_is_device_ready(m24512e_handle_t *handle)
{
    if (!handle || !handle->hi2c) {
        return false;
    }

    uint8_t device_select = m24512e_get_device_select_code(M24512E_MEMORY_DEVICE_CODE,
                                                          handle->device_address, false);

    return (HAL_I2C_IsDeviceReady(handle->hi2c, device_select, 3, M24512E_I2C_TIMEOUT) == HAL_OK);
}

/**
 * @brief Write single byte to memory
 * @param handle Pointer to device handle
 * @param address Memory address (0-65535)
 * @param data Data byte to write
 * @return Status code
 */
m24512e_status_t m24512e_write_byte(m24512e_handle_t *handle, uint16_t address, uint8_t data)
{
    if (!handle || !handle->hi2c || address >= M24512E_DEVICE_SIZE) {
        return M24512E_INVALID_ADDRESS;
    }

    uint8_t device_select = m24512e_get_device_select_code(M24512E_MEMORY_DEVICE_CODE,
                                                          handle->device_address, false);
    uint8_t buffer[3] = {
        (uint8_t)(address >> 8),    // Address high byte
        (uint8_t)(address & 0xFF),  // Address low byte
        data                        // Data byte
    };

    HAL_StatusTypeDef hal_status = HAL_I2C_Master_Transmit(handle->hi2c, device_select,
                                                          buffer, 3, M24512E_I2C_TIMEOUT);

    if (hal_status != HAL_OK) {
        return (hal_status == HAL_TIMEOUT) ? M24512E_TIMEOUT : M24512E_ERROR;
    }

    handle->last_write_time = HAL_GetTick();
    return M24512E_OK;
}

/**
 * @brief Write page to memory
 * @param handle Pointer to device handle
 * @param address Starting memory address
 * @param data Pointer to data buffer
 * @param size Number of bytes to write (max 128 for same page)
 * @return Status code
 */
m24512e_status_t m24512e_write_page(m24512e_handle_t *handle, uint16_t address,
                                   const uint8_t *data, uint16_t size)
{
    if (!handle || !handle->hi2c || !data || address >= M24512E_DEVICE_SIZE || size == 0) {
        return M24512E_ERROR;
    }

    /* Check if write crosses page boundary */
    uint16_t page_start = address & ~(M24512E_PAGE_SIZE - 1);
    uint16_t page_end = page_start + M24512E_PAGE_SIZE - 1;

    if (address + size - 1 > page_end) {
        return M24512E_INVALID_SIZE;
    }

    if (size > M24512E_PAGE_SIZE) {
        return M24512E_INVALID_SIZE;
    }

    uint8_t device_select = m24512e_get_device_select_code(M24512E_MEMORY_DEVICE_CODE,
                                                          handle->device_address, false);

    /* Prepare transmission buffer */
    uint8_t tx_buffer[M24512E_PAGE_SIZE + 2];
    tx_buffer[0] = (uint8_t)(address >> 8);
    tx_buffer[1] = (uint8_t)(address & 0xFF);

    for (uint16_t i = 0; i < size; i++) {
        tx_buffer[i + 2] = data[i];
    }

    HAL_StatusTypeDef hal_status = HAL_I2C_Master_Transmit(handle->hi2c, device_select,
                                                          tx_buffer, size + 2, M24512E_I2C_TIMEOUT);

    if (hal_status != HAL_OK) {
        return (hal_status == HAL_TIMEOUT) ? M24512E_TIMEOUT : M24512E_ERROR;
    }

    handle->last_write_time = HAL_GetTick();
    return M24512E_OK;
}

/**
 * @brief Write page with CRC16 verification
 * @param handle Pointer to device handle
 * @param address Starting memory address
 * @param data Pointer to data buffer
 * @param size Number of bytes to write
 * @return Status code
 */
m24512e_status_t m24512e_write_page_with_crc(m24512e_handle_t *handle, uint16_t address,
                                            const uint8_t *data, uint16_t size)
{
    m24512e_status_t status = m24512e_write_page(handle, address, data, size);
    if (status != M24512E_OK) {
        return status;
    }

    /* Wait for write completion */
    status = m24512e_wait_write_complete(handle);
    if (status != M24512E_OK) {
        return status;
    }

    /* Verify with CRC */
    uint8_t read_buffer[M24512E_PAGE_SIZE];
    status = m24512e_read_sequential(handle, address, read_buffer, size);
    if (status != M24512E_OK) {
        return status;
    }

