Yolk-Workshop/Yolk-Keyboard/Core/Src/hardware/m24512e_driver.c
    uint16_t original_crc = m24512e_calculate_crc16(data, size);
    uint16_t read_crc = m24512e_calculate_crc16(read_buffer, size);

    return (original_crc == read_crc) ? M24512E_OK : M24512E_CRC_ERROR;
}

/**
 * @brief Read single byte from memory
 * @param handle Pointer to device handle
 * @param address Memory address
 * @param data Pointer to store read data
 * @return Status code
 */
m24512e_status_t m24512e_read_byte(m24512e_handle_t *handle, uint16_t address, uint8_t *data)
{
    if (!handle || !handle->hi2c || !data || address >= M24512E_DEVICE_SIZE) {
        return M24512E_ERROR;
    }

    uint8_t device_select_write = m24512e_get_device_select_code(M24512E_MEMORY_DEVICE_CODE,
                                                               handle->device_address, false);
    uint8_t device_select_read = m24512e_get_device_select_code(M24512E_MEMORY_DEVICE_CODE,
                                                              handle->device_address, true);

    uint8_t addr_buffer[2] = {
        (uint8_t)(address >> 8),
        (uint8_t)(address & 0xFF)
    };

    /* Dummy write to set address */
    HAL_StatusTypeDef hal_status = HAL_I2C_Master_Transmit(handle->hi2c, device_select_write,
                                                          addr_buffer, 2, M24512E_I2C_TIMEOUT);
    if (hal_status != HAL_OK) {
        return (hal_status == HAL_TIMEOUT) ? M24512E_TIMEOUT : M24512E_ERROR;
    }

    /* Read data */
    hal_status = HAL_I2C_Master_Receive(handle->hi2c, device_select_read, data, 1, M24512E_I2C_TIMEOUT);

    if (hal_status != HAL_OK) {
        return (hal_status == HAL_TIMEOUT) ? M24512E_TIMEOUT : M24512E_ERROR;
    }

    return M24512E_OK;
}

/**
 * @brief Read sequential bytes from memory
 * @param handle Pointer to device handle
 * @param address Starting memory address
 * @param data Pointer to data buffer
 * @param size Number of bytes to read
 * @return Status code
 */
m24512e_status_t m24512e_read_sequential(m24512e_handle_t *handle, uint16_t address,
                                        uint8_t *data, uint16_t size)
{
    if (!handle || !handle->hi2c || !data || address >= M24512E_DEVICE_SIZE || size == 0) {
        return M24512E_ERROR;
    }

    if (address + size > M24512E_DEVICE_SIZE) {
        return M24512E_INVALID_SIZE;
    }

    uint8_t device_select_write = m24512e_get_device_select_code(M24512E_MEMORY_DEVICE_CODE,
                                                               handle->device_address, false);
    uint8_t device_select_read = m24512e_get_device_select_code(M24512E_MEMORY_DEVICE_CODE,
                                                              handle->device_address, true);

    uint8_t addr_buffer[2] = {
        (uint8_t)(address >> 8),
        (uint8_t)(address & 0xFF)
    };

    /* Dummy write to set address */
    HAL_StatusTypeDef hal_status = HAL_I2C_Master_Transmit(handle->hi2c, device_select_write,
                                                          addr_buffer, 2, M24512E_I2C_TIMEOUT);
    if (hal_status != HAL_OK) {
        return (hal_status == HAL_TIMEOUT) ? M24512E_TIMEOUT : M24512E_ERROR;
    }

    /* Sequential read */
    hal_status = HAL_I2C_Master_Receive(handle->hi2c, device_select_read, data, size, M24512E_I2C_TIMEOUT);

    if (hal_status != HAL_OK) {
        return (hal_status == HAL_TIMEOUT) ? M24512E_TIMEOUT : M24512E_ERROR;
    }

    return M24512E_OK;
}

/**
 * @brief Read sequential bytes with CRC16 verification
 * @param handle Pointer to device handle
 * @param address Starting memory address
 * @param data Pointer to data buffer
 * @param size Number of bytes to read
 * @return Status code
 */
m24512e_status_t m24512e_read_sequential_with_crc(m24512e_handle_t *handle, uint16_t address,
                                                 uint8_t *data, uint16_t size)
{
    m24512e_status_t status = m24512e_read_sequential(handle, address, data, size);
    if (status != M24512E_OK) {
        return status;
    }

    /* Read again for verification */
    uint8_t verify_buffer[size];
    status = m24512e_read_sequential(handle, address, verify_buffer, size);
    if (status != M24512E_OK) {
        return status;
    }

    /* Compare CRCs */
    uint16_t first_crc = m24512e_calculate_crc16(data, size);
    uint16_t second_crc = m24512e_calculate_crc16(verify_buffer, size);

    return (first_crc == second_crc) ? M24512E_OK : M24512E_CRC_ERROR;
}

/**
 * @brief Read current address (using internal address counter)
 * @param handle Pointer to device handle
 * @param data Pointer to store read data
 * @return Status code
 */
m24512e_status_t m24512e_read_current(m24512e_handle_t *handle, uint8_t *data)
{
    if (!handle || !handle->hi2c || !data) {
        return M24512E_ERROR;
    }

    uint8_t device_select_read = m24512e_get_device_select_code(M24512E_MEMORY_DEVICE_CODE,
                                                              handle->device_address, true);

    HAL_StatusTypeDef hal_status = HAL_I2C_Master_Receive(handle->hi2c, device_select_read,
                                                         data, 1, M24512E_I2C_TIMEOUT);

    if (hal_status != HAL_OK) {
        return (hal_status == HAL_TIMEOUT) ? M24512E_TIMEOUT : M24512E_ERROR;
    }

    return M24512E_OK;
}

/**
 * @brief Read Device Type Identifier register
 * @param handle Pointer to device handle
 * @param dti_reg Pointer to DTI register structure
 * @return Status code
 */
m24512e_status_t m24512e_read_dti_register(m24512e_handle_t *handle, m24512e_dti_reg_t *dti_reg)
{
    if (!handle || !dti_reg) {
        return M24512E_ERROR;
    }

    uint8_t reg_value;
    m24512e_status_t status = m24512e_read_register(handle, M24512E_DTI_ADDRESS_CODE, &reg_value);

    if (status == M24512E_OK) {
        dti_reg->dti3 = (reg_value >> 7) & 0x01;
        dti_reg->dti2 = (reg_value >> 6) & 0x01;
        dti_reg->dti1 = (reg_value >> 5) & 0x01;
        dti_reg->dti0 = (reg_value >> 4) & 0x01;
        dti_reg->reserved = (reg_value >> 1) & 0x07;
        dti_reg->dtil = reg_value & 0x01;
    }

