Yolk-Workshop/Yolk-Keyboard/Core/Src/hardware/m24512e_driver.c
    return status;
}

/**
 * @brief Read Configurable Device Address register
 * @param handle Pointer to device handle
 * @param cda_reg Pointer to CDA register structure
 * @return Status code
 */
m24512e_status_t m24512e_read_cda_register(m24512e_handle_t *handle, m24512e_cda_reg_t *cda_reg)
{
    if (!handle || !cda_reg) {
        return M24512E_ERROR;
    }

    uint8_t reg_value;
    m24512e_status_t status = m24512e_read_register(handle, M24512E_CDA_ADDRESS_CODE, &reg_value);

    if (status == M24512E_OK) {
        cda_reg->dal = reg_value & 0x01;
        cda_reg->c0 = (reg_value >> 1) & 0x01;
        cda_reg->c1 = (reg_value >> 2) & 0x01;
        cda_reg->c2 = (reg_value >> 3) & 0x01;
        cda_reg->reserved = (reg_value >> 4) & 0x0F;
    }

    return status;
}

/**
 * @brief Write Configurable Device Address register
 * @param handle Pointer to device handle
 * @param cda_reg Pointer to CDA register structure
 * @return Status code
 */
m24512e_status_t m24512e_write_cda_register(m24512e_handle_t *handle, const m24512e_cda_reg_t *cda_reg)
{
    if (!handle || !cda_reg) {
        return M24512E_ERROR;
    }

    uint8_t reg_value = (cda_reg->dal & 0x01) |
                       ((cda_reg->c0 & 0x01) << 1) |
                       ((cda_reg->c1 & 0x01) << 2) |
                       ((cda_reg->c2 & 0x01) << 3);

    return m24512e_write_register(handle, M24512E_CDA_ADDRESS_CODE, reg_value);
}

/**
 * @brief Read Software Write Protection register
 * @param handle Pointer to device handle
 * @param swp_reg Pointer to SWP register structure
 * @return Status code
 */
m24512e_status_t m24512e_read_swp_register(m24512e_handle_t *handle, m24512e_swp_reg_t *swp_reg)
{
    if (!handle || !swp_reg) {
        return M24512E_ERROR;
    }

    uint8_t reg_value;
    m24512e_status_t status = m24512e_read_register(handle, M24512E_SWP_ADDRESS_CODE, &reg_value);

    if (status == M24512E_OK) {
        swp_reg->wpl = reg_value & 0x01;
        swp_reg->bp0 = (reg_value >> 1) & 0x01;
        swp_reg->bp1 = (reg_value >> 2) & 0x01;
        swp_reg->wpa = (reg_value >> 3) & 0x01;
        swp_reg->reserved = (reg_value >> 4) & 0x0F;
    }

    return status;
}

/**
 * @brief Write Software Write Protection register
 * @param handle Pointer to device handle
 * @param swp_reg Pointer to SWP register structure
 * @return Status code
 */
m24512e_status_t m24512e_write_swp_register(m24512e_handle_t *handle, const m24512e_swp_reg_t *swp_reg)
{
    if (!handle || !swp_reg) {
        return M24512E_ERROR;
    }

    uint8_t reg_value = (swp_reg->wpl & 0x01) |
                       ((swp_reg->bp0 & 0x01) << 1) |
                       ((swp_reg->bp1 & 0x01) << 2) |
                       ((swp_reg->wpa & 0x01) << 3);

    return m24512e_write_register(handle, M24512E_SWP_ADDRESS_CODE, reg_value);
}

/**
 * @brief Write to identification page
 * @param handle Pointer to device handle
 * @param address Address within ID page (0-127)
 * @param data Pointer to data buffer
 * @param size Number of bytes to write
 * @return Status code
 */
m24512e_status_t m24512e_write_id_page(m24512e_handle_t *handle, uint8_t address,
                                      const uint8_t *data, uint8_t size)
{
    if (!handle || !handle->hi2c || !data || address >= M24512E_ID_PAGE_SIZE) {
        return M24512E_ERROR;
    }

    if (address + size > M24512E_ID_PAGE_SIZE) {
        return M24512E_INVALID_SIZE;
    }

    uint8_t device_select = m24512e_get_device_select_code(M24512E_FEATURE_DEVICE_CODE,
                                                          handle->device_address, false);

    uint8_t tx_buffer[M24512E_ID_PAGE_SIZE + 2];
    tx_buffer[0] = M24512E_ID_PAGE_ADDRESS_CODE;
    tx_buffer[1] = address;

    for (uint8_t i = 0; i < size; i++) {
        tx_buffer[i + 2] = data[i];
    }

    HAL_StatusTypeDef hal_status = HAL_I2C_Master_Transmit(handle->hi2c, device_select,
                                                          tx_buffer, size + 2, M24512E_I2C_TIMEOUT);

    if (hal_status != HAL_OK) {
        return (hal_status == HAL_TIMEOUT) ? M24512E_TIMEOUT : M24512E_ERROR;
    }

    handle->last_write_time = HAL_GetTick();
    return M24512E_OK;
}

/**
 * @brief Read from identification page
 * @param handle Pointer to device handle
 * @param address Address within ID page (0-127)
 * @param data Pointer to data buffer
 * @param size Number of bytes to read
 * @return Status code
 */
m24512e_status_t m24512e_read_id_page(m24512e_handle_t *handle, uint8_t address,
                                     uint8_t *data, uint8_t size)
{
    if (!handle || !handle->hi2c || !data || address >= M24512E_ID_PAGE_SIZE) {
        return M24512E_ERROR;
    }

    if (address + size > M24512E_ID_PAGE_SIZE) {
        return M24512E_INVALID_SIZE;
    }

    uint8_t device_select_write = m24512e_get_device_select_code(M24512E_FEATURE_DEVICE_CODE,
                                                               handle->device_address, false);
    uint8_t device_select_read = m24512e_get_device_select_code(M24512E_FEATURE_DEVICE_CODE,
                                                              handle->device_address, true);

    uint8_t addr_buffer[2] = {
        M24512E_ID_PAGE_ADDRESS_CODE,
        address
    };

    /* Dummy write to set address */
    HAL_StatusTypeDef hal_status = HAL_I2C_Master_Transmit(handle->hi2c, device_select_write,
                                                          addr_buffer, 2, M24512E_I2C_TIMEOUT);
    if (hal_status != HAL_OK) {
        return (hal_status == HAL_TIMEOUT) ? M24512E_TIMEOUT : M24512E_ERROR;
    }

    /* Read data */
    hal_status = HAL_I2C_Master_Receive(handle->hi2c, device_select_read, data, size, M24512E_I2C_TIMEOUT);

    if (hal_status != HAL_OK) {
        return (hal_status == HAL_TIMEOUT) ? M24512E_TIMEOUT : M24512E_ERROR;
    }

    return M24512E_OK;
}

/**
 * @brief Lock identification page permanently
 * @param handle Pointer to device handle
 * @return Status code
 */
m24512e_status_t m24512e_lock_id_page(m24512e_handle_t *handle)
{
    if (!handle || !handle->hi2c) {
        return M24512E_ERROR;
    }

    uint8_t device_select = m24512e_get_device_select_code(M24512E_FEATURE_DEVICE_CODE,
                                                          handle->device_address, false);

    uint8_t lock_command[3] = {
        M24512E_ID_LOCK_ADDRESS_CODE,
        0x00,  // Don't care address
        0x02   // Lock bit pattern (xxxx xx1x)
    };

    HAL_StatusTypeDef hal_status = HAL_I2C_Master_Transmit(handle->hi2c, device_select,
                                                          lock_command, 3, M24512E_I2C_TIMEOUT);

