Yolk-Workshop/Yolk-Keyboard/Core/Src/hardware/m24512e_driver.c
    if (hal_status != HAL_OK) {
        return (hal_status == HAL_TIMEOUT) ? M24512E_TIMEOUT : M24512E_ERROR;
    }

    handle->last_write_time = HAL_GetTick();
    return M24512E_OK;
}

/**
 * @brief Check if identification page is locked
 * @param handle Pointer to device handle
 * @return true if locked, false if unlocked or error
 */
bool m24512e_is_id_page_locked(m24512e_handle_t *handle)
{
    if (!handle || !handle->hi2c) {
        return false;
    }

    uint8_t device_select = m24512e_get_device_select_code(M24512E_FEATURE_DEVICE_CODE,
                                                          handle->device_address, false);

    uint8_t test_command[3] = {
        M24512E_ID_LOCK_ADDRESS_CODE,
        0x00,  // Don't care address
        0xFF   // Test data
    };

    /* Send test write command - if locked, will get NO ACK */
    HAL_StatusTypeDef hal_status = HAL_I2C_Master_Transmit(handle->hi2c, device_select,
                                                          test_command, 3, M24512E_I2C_TIMEOUT);

    /* Send start-stop sequence to reset device state */
    HAL_I2C_Master_Transmit(handle->hi2c, device_select, NULL, 0, M24512E_I2C_TIMEOUT);

    /* If command was NACKed, page is locked */
    return (hal_status != HAL_OK);
}

/**
 * @brief Wait for write cycle completion using ACK polling
 * @param handle Pointer to device handle
 * @return Status code
 */
m24512e_status_t m24512e_wait_write_complete(m24512e_handle_t *handle)
{
    if (!handle || !handle->hi2c) {
        return M24512E_ERROR;
    }

    uint32_t start_time = HAL_GetTick();
    uint8_t device_select = m24512e_get_device_select_code(M24512E_MEMORY_DEVICE_CODE,
                                                          handle->device_address, false);

    /* Poll for ACK response */
    while ((HAL_GetTick() - start_time) < M24512E_WRITE_CYCLE_TIME) {
        if (HAL_I2C_IsDeviceReady(handle->hi2c, device_select, 1, 1) == HAL_OK) {
            return M24512E_OK;
        }
        HAL_Delay(1);
    }

    return M24512E_TIMEOUT;
}

/**
 * @brief Initialize CRC peripheral for CRC-16 calculation
 * @note Configure STM32L072 CRC peripheral for 16-bit polynomial
 */
static void m24512e_crc_init(void)
{
    /* Configure CRC for CRC-16 CCITT polynomial */
    CRC->CR = CRC_CR_POLYSIZE_0;               // 16-bit polynomial (POLYSIZE = 01)
    CRC->POL = CRC16_POLYNOMIAL;               // Set CRC-16 polynomial (0x1021)
    CRC->INIT = 0xFFFFUL;                      // Set initial value

    /* Reset CRC calculation unit */
    CRC->CR |= CRC_CR_RESET;
}

/**
 * @brief Calculate CRC16 using STM32L072 hardware CRC unit
 * @param data Pointer to data buffer
 * @param size Number of bytes
 * @return CRC16 value
 */
uint16_t m24512e_calculate_crc16(const uint8_t *data, uint16_t size)
{
    if (!data || size == 0) {
        return 0;
    }

    /* Ensure CRC is initialized */
    static bool crc_initialized = false;
    if (!crc_initialized) {
        m24512e_crc_init();
        crc_initialized = true;
    }

    /* Reset CRC calculation */
    CRC->CR |= CRC_CR_RESET;

    /* Process data byte by byte for CRC-16 */
    volatile uint8_t *crc_dr_8 = (volatile uint8_t *)&CRC->DR;

    for (uint16_t i = 0; i < size; i++) {
        *crc_dr_8 = data[i];
    }

    /* Return 16-bit CRC result (lower 16 bits of DR register) */
    return (uint16_t)(CRC->DR & 0xFFFF);
}

/**
 * @brief Verify CRC16 of data
 * @param data Pointer to data buffer
 * @param size Number of bytes
 * @param expected_crc Expected CRC16 value
 * @return true if CRC matches, false otherwise
 */
bool m24512e_verify_crc16(const uint8_t *data, uint16_t size, uint16_t expected_crc)
{
    uint16_t calculated_crc = m24512e_calculate_crc16(data, size);
    return (calculated_crc == expected_crc);
}

/**
 * @brief Write and verify data with automatic page handling
 * @param handle Pointer to device handle
 * @param address Starting address
 * @param data Pointer to data buffer
 * @param size Total number of bytes to write
 * @return Status code
 */
m24512e_status_t m24512e_write_data_safe(m24512e_handle_t *handle, uint16_t address,
                                        const uint8_t *data, uint16_t size)
{
    if (!handle || !data || size == 0) {
        return M24512E_ERROR;
    }

    uint16_t bytes_written = 0;
    m24512e_status_t status;

    while (bytes_written < size) {
        /* Calculate current page boundaries */
        uint16_t current_addr = address + bytes_written;
        uint16_t page_start = current_addr & ~(M24512E_PAGE_SIZE - 1);
        uint16_t page_end = page_start + M24512E_PAGE_SIZE - 1;
        uint16_t bytes_to_page_end = page_end - current_addr + 1;

        /* Determine how many bytes to write in this operation */
        uint16_t bytes_to_write = (size - bytes_written > bytes_to_page_end) ?
                                 bytes_to_page_end : (size - bytes_written);

        /* Write page with CRC verification */
        status = m24512e_write_page_with_crc(handle, current_addr,
                                           &data[bytes_written], bytes_to_write);
        if (status != M24512E_OK) {
            return status;
        }

        bytes_written += bytes_to_write;

        /* Wait for write completion before next page */
        if (bytes_written < size) {
            status = m24512e_wait_write_complete(handle);
            if (status != M24512E_OK) {
                return status;
            }
        }
    }

    return M24512E_OK;
}

/* Private Functions */

/**
 * @brief Write to feature register
 * @param handle Pointer to device handle
 * @param addr_high High address byte for register selection
 * @param data Data byte to write
 * @return Status code
 */
static m24512e_status_t m24512e_write_register(m24512e_handle_t *handle, uint8_t addr_high, uint8_t data)
{
    uint8_t device_select = m24512e_get_device_select_code(M24512E_FEATURE_DEVICE_CODE,
                                                          handle->device_address, false);

    uint8_t buffer[3] = {
        addr_high,
        0x00,  // Don't care low address
        data
    };

    HAL_StatusTypeDef hal_status = HAL_I2C_Master_Transmit(handle->hi2c, device_select,
                                                          buffer, 3, M24512E_I2C_TIMEOUT);

