Yolk-Workshop/Yolk-Keyboard/Core/Src/hardware/m24512e_driver.c
    if (hal_status != HAL_OK) {
        return (hal_status == HAL_TIMEOUT) ? M24512E_TIMEOUT : M24512E_ERROR;
    }

    handle->last_write_time = HAL_GetTick();
    return M24512E_OK;
}

/**
 * @brief Read from feature register
 * @param handle Pointer to device handle
 * @param addr_high High address byte for register selection
 * @param data Pointer to store read data
 * @return Status code
 */
static m24512e_status_t m24512e_read_register(m24512e_handle_t *handle, uint8_t addr_high, uint8_t *data)
{
    uint8_t device_select_write = m24512e_get_device_select_code(M24512E_FEATURE_DEVICE_CODE,
                                                               handle->device_address, false);
    uint8_t device_select_read = m24512e_get_device_select_code(M24512E_FEATURE_DEVICE_CODE,
                                                              handle->device_address, true);

    uint8_t addr_buffer[2] = {
        addr_high,
        0x00  // Don't care low address
    };

    /* Dummy write to set register address */
    HAL_StatusTypeDef hal_status = HAL_I2C_Master_Transmit(handle->hi2c, device_select_write,
                                                          addr_buffer, 2, M24512E_I2C_TIMEOUT);
    if (hal_status != HAL_OK) {
        return (hal_status == HAL_TIMEOUT) ? M24512E_TIMEOUT : M24512E_ERROR;
    }

    /* Read register data */
    hal_status = HAL_I2C_Master_Receive(handle->hi2c, device_select_read, data, 1, M24512E_I2C_TIMEOUT);

    if (hal_status != HAL_OK) {
        return (hal_status == HAL_TIMEOUT) ? M24512E_TIMEOUT : M24512E_ERROR;
    }

    return M24512E_OK;
}

/**
 * @brief Generate device select code
 * @param base_code Base device code (0xA0 for memory, 0xB0 for features)
 * @param chip_addr Chip enable address (0-7)
 * @param read_operation true for read, false for write
 * @return Device select code
 */
static uint8_t m24512e_get_device_select_code(uint8_t base_code, uint8_t chip_addr, bool read_operation)
{
    uint8_t device_select = base_code | ((chip_addr & 0x07) << 1);

    if (read_operation) {
        device_select |= 0x01;  // Set R/W bit for read
    }

    return device_select;
}
